let age = prompt('আপনার বয়স উল্লেখ করুন');
if (age < 18){
    console.log(` তুমি এখনও পিচ্চি, বিয়ের বয়স হয় নাই। ধৈর্য ধরে আরো ${18 - age} বছর অপেক্ষা কর ! তার পর বিয়ে কইরো ।`);
}
else if (age >= 18 && age <= 45){
console.log('আপনার বিবাহের বয়স হয়েগেছে,এখন বিয়ে করতে পারেন');
}

else if (age >= 46 && age < 60){
    console.log(' আপনার বিয়ের বয়স তো বেশি হয়ে গেছে !!! এখন বুরা বয়োসে মেয়ে দিবে কে ? ')
}
else{
    console.log(' আপনার বিয়ে করার বয়স সেশ !!! এখন আল্লাহ বিল্লাহ করেন্‌......! বিয়ের চিন্তা বাদ দেন। ')
}